Revit 2027 API
StairsRunType.UndersideSurfaceStyle Property
 The underside surface style of the stairs run, only available for monolithic stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StairsUndersideSurfaceStyle UndersideSurfaceStyle { get; set; }
Public Property UndersideSurfaceStyle As StairsUndersideSurfaceStyle
	Get
	Set
public:
property StairsUndersideSurfaceStyle UndersideSurfaceStyle {
	StairsUndersideSurfaceStyle get ();
	void set (StairsUndersideSurfaceStyle value);
}
member UndersideSurfaceStyle : StairsUndersideSurfaceStyle with get, set
Property Value
StairsUndersideSurfaceStyle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: The stairs run type is not a monolithic type so the data being set is not applicable.
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace